In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [3]:
# nan olanları çıkartmak istersek 
# havaDurumuDataFrame.dropna()
# yapmamız yeterli ama tüm satır boyunca çıkartıyor bu seferde aslında veri kaybı oluyor

In [4]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [7]:
yeniVeri = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,38], "Antalya": [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [8]:
yeniDataFrame.dropna(axis = 1, thresh = 2)
# bunu yazdığımızda sütunları al orada 2 ve üzeri NaN olanları atıyor gerisini gösteriyor

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
# mesela NaN yaanl yere bir veri koymak istedik diyelim:
yeniDataFrame.fillna(10) # mesela NaN yazan yerlere 10 koy demiş olduk

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    10.0     39     10.0
2      10.0    25.0     38     10.0

## groupby

In [10]:
maasSozlugu = {"Departman": ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
              "Calısan Ismi": ["Muhammed", "Enes", "Yılmaz", "Furkan", "Merve", "Ayşe"],
              "Maas": [100,200,300,400,500,600]
              }

In [11]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [12]:
maasDataFrame

   Departman Calısan Ismi  Maas
0    Yazılım     Muhammed   100
1    Yazılım         Enes   200
2  Pazarlama       Yılmaz   300
3  Pazarlama       Furkan   400
4      Hukuk        Merve   500
5      Hukuk         Ayşe   600

In [13]:
grupObjesi = maasDataFrame.groupby("Departman")

In [14]:
grupObjesi.count()

           Calısan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [15]:
grupObjesi.mean()

            Maas
Departman
Hukuk      550.0
Pazarlama  350.0
Yazılım    150.0

In [16]:
grupObjesi.min()

          Calısan Ismi  Maas
Departman
Hukuk             Ayşe   500
Pazarlama       Furkan   300
Yazılım           Enes   100

In [17]:
grupObjesi.max()

          Calısan Ismi  Maas
Departman
Hukuk            Merve   600
Pazarlama       Yılmaz   400
Yazılım       Muhammed   200

In [18]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0